#include <stdio.h>

// Три базовые управляющие конструкции:
// - последовательность
// - условие
// - цикл

// Циклы:
// - do-while (цикл с постусловием) - сначала делает, а потом спрашивает - нужно ли повторить?
// int i = 0;
// do {
//     printf("%d ", array[i]);
//     i = i + 1;
// } while (i < 5);

// - while - цикл с предусловием, сначала спрашивает - и если условие истинно, начинает делать
// int i = 0;
// while (i < 5) {
//     printf("%d ", array[i]);
//     i += 1;
// }

// Программа считает сумму ЧЁТНЫХ ЭЛЕМЕНТОВ (по значению) заданного массива и выводит на экран
int main() {
    int array[5] = {1, 2, 3, 4, 5};
    int n = 5, sum = 0;

    int i = 0;
    while (i < n) {
        if (array[i] % 2 == 0) {
            sum += array[i];
        }
        i += 1;
    }
    printf("%d\n", sum);
    return 0;
}

// Программа запрашивает у пользователя число n и выводит СУММУ всех числа от 1 до n включительно
// int main() {
//     int n, i = 0, sum = 0;
//     scanf("%d", &n);
//     while (i < n) {
//         i += 1;
//         sum += i;
//     }
//     printf("%d\n", sum);
//     return 0;
// }

// Программа запрашивает у пользователя число n и выводит все числа от 1 до n включительно
// int main() {
//     int n, i=0;
//     scanf("%d", &n);
//     while (i < n) {
//         i+=1;
//         printf("%d\n", i);
//     }
//     return 0;
// }